src/CF/DataProcessors/СменаУсловийУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>СменаУсловийУчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/CF/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбратныйПересчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/DataProcessors/СменаУсловийУчета/Forms/ФормаСменыОсновнойВалютыУчета/Ext/Form/Module.bsl
//sza140331-1638 : 
&НаКлиенте
Процедура ВыполнитьСменуОсновнойВалютыУчета(Команда)
	
	Если ЗначениеЗаполнено(СменитьНаВалюту)
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы к необратимой смене основной валюты учета?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Смена валюты учета"), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ВыполнитьСменуОсновнойВалютыУчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСменуОсновнойВалютыУчетаНаСервере()
	
	ОсновнаяВалюта = ТекущаяОсновнаяВалюта.ПолучитьОбъект();
	Код = ОсновнаяВалюта.Код;
	ОсновнаяВалюта.Код = СменитьНаВалюту.Код;
	Комментарий = ОсновнаяВалюта.Комментарий;
	ОсновнаяВалюта.Комментарий = СменитьНаВалюту.Комментарий;
	Наименование = ОсновнаяВалюта.Наименование;
	ОсновнаяВалюта.Наименование = СменитьНаВалюту.Наименование;
	ОсновнаяВалюта.Записать();
	ТекущаяОсновнаяВалюта = ОсновнаяВалюта.ссылка;
	
	ОбщийМодульТекстСервер.ПередатьПереводыДругомуОбъекту(ТекущаяОсновнаяВалюта, СменитьНаВалюту);
	
	СменитьНаВалютуОбъект = СменитьНаВалюту.ПолучитьОбъект();
	СменитьНаВалютуОбъект.Код = Код;
	СменитьНаВалютуОбъект.Комментарий = Комментарий;
	СменитьНаВалютуОбъект.Наименование = Наименование;
	СменитьНаВалютуОбъект.Записать();
	
	СменитьНаВалюту = СменитьНаВалютуОбъект.ссылка;
	
	Если НЕ НеПереустанавливатьКурсыВалют Тогда
		Курсы = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		Курсы.Прочитать();
		
		Для Каждого Курс из Курсы Цикл
			Если НЕ курс.Курс = 0 Тогда
				курс.Курс = 1 / курс.Курс;	
			КонецЕсли;
		КонецЦикла;
		Курсы.Записать(ИСТИНА);
		
	КонецЕсли;
	
	Если НЕ НеПересчитыватьЦеныПоКурсу
		И НЕ СтрогийКурсПересчетаЦен = 0 Тогда	
		
		Цены = РегистрыСведений.Цены.СоздатьНаборЗаписей();
		Цены.Прочитать();
		Для Каждого Цена Из Цены Цикл
			Если НЕ цена.Цена = 0 Тогда
				Цена.цена = Цена.цена / СтрогийКурсПересчетаЦен;
			КонецЕсли;	
		КонецЦикла;
		Цены.записать(ИСТИНА);
		
	КонецЕсли;
	
	Если НЕ НеПереоцениватьВзаиморасчетыСКонтрагентами Тогда
		
		//утопия		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	Если ЗначениеЗаполнено(СменитьНаВалюту) Тогда
		СменитьНаВалютуПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").ПолучитьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьНаВалютуПриИзменении(Элемент)
	СменитьНаВалютуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СменитьНаВалютуПриИзмененииНаСервере()
	СтрогийКурсПересчетаЦен = ОбщийМодульПовтор.ПолучитьТекущийКурс(СменитьНаВалюту, ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры
